# Волкова Татьяна | ПИ19-2 | Pandas | ML0.2
## Практические задания

In [1]:
import pandas as pd
import datetime as dt
import numpy as np

### 1.	Получить файл (Titanic.csv) набора данных, прилагающийся к этой работе.

### 2.	Считать файл в pandas DataFrame

In [2]:
data = pd.read_csv('Titanic.csv', sep=',')
data.head()

,Name,PClass,Age,Sex,Survived
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0
4,"Allison, Master Hudson Trevor",1st,0.92,male,1

### 3.	Ознакомиться с основными параметрами датасета, используя функции библиотеки pandas, включая следующие данные:

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      1313 non-null   object
 1   PClass    1312 non-null   object
 2   Age       756 non-null    float64
 3   Sex       1313 non-null   object
 4   Survived  1313 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 51.4+ KB

#### a.	Количество точек данных (измерений) в наборе

In [4]:
data.shape[0]

1313

#### b.	Количество полей данных (атрибутов)

In [5]:
data.shape[1]

5

#### c.	Тип данных каждого поля, шкала каждого поля

In [6]:
print(f'   типы данных \n{data.dtypes} \n   шкалы \n{data.apply(lambda s: s.unique())}')

   типы данных
Name         object
PClass       object
Age         float64
Sex          object
Survived      int64
dtype: object
   шкалы
Name        [Allen, Miss Elisabeth Walton, Allison, Miss H...
PClass                                   [1st, 2nd, nan, 3rd]
Age         [29.0, 2.0, 30.0, 25.0, 0.92, 47.0, 63.0, 39.0...
Sex                                            [female, male]
Survived                                               [1, 0]
dtype: object

#### d.	Количество отсутствующих значений для каждого поля

In [7]:
#data.isnull().sum()
data.isna().sum()

Name          0
PClass        1
Age         557
Sex           0
Survived      0
dtype: int64

#### e.	Количество и названия константных и уникальных полей

In [8]:
print('количество уникальных полей - ', data.apply(lambda s: len(s.unique()) == len(s)).sum())
print('количество константных полей - ', data.apply(lambda s: len(s.unique()) == 1).sum())

количество уникальных полей -  0
количество константных полей -  0

Логически:
Количество уникальных полей - 1 (Name)
Количество константных полей - 0

Если считать, что константное поле - поле, не изменяющееся со временем,
то константных полей будет 3 - PClass, Sex, Survived (возраст и имя могут изменяться)

### 4.	Удалить из набора поля, не несущие информативной нагрузки - содержащие уникальные либо константные значения

In [9]:
data = data.drop('Name', axis=1)
data.head()

  PClass    Age     Sex  Survived
0    1st  29.00  female         1
1    1st   2.00  female         0
2    1st  30.00    male         0
3    1st  25.00  female         0
4    1st   0.92    male         1

### 5.	Заменить возраст пассажиров на год рождения

In [10]:
data["Age"] = (dt.datetime.now().year - data["Age"])
data = data.rename(columns = {'Age': "BirthYear"})
data.head()

  PClass  BirthYear     Sex  Survived
0    1st    1993.00  female         1
1    1st    2020.00  female         0
2    1st    1992.00    male         0
3    1st    1997.00  female         0
4    1st    2021.08    male         1

### 6.	Переименовать все названия колонок на русском языке

In [11]:
data = data.rename(columns={'PClass': 'Класс пассажира', 
                            'BirthYear': 'Год рождения', 
                            'Sex': 'Пол', 
                            'Survived': 'Выживший'})
data.head()

  Класс пассажира  Год рождения     Пол  Выживший
0             1st       1993.00  female         1
1             1st       2020.00  female         0
2             1st       1992.00    male         0
3             1st       1997.00  female         0
4             1st       2021.08    male         1

### 7.	Заменить все отсутствующие данные средним значением (в случае числового поля) либо самым распространенным в категориальных полях.

In [12]:
data.isna().sum()

Класс пассажира      1
Год рождения       557
Пол                  0
Выживший             0
dtype: int64

In [13]:
data['Год рождения'] = data['Год рождения'].fillna(data['Год рождения'].mean())
data['Класс пассажира'] = data['Класс пассажира'].fillna(data['Класс пассажира'].mode().item())

data['Год рождения'] = data['Год рождения'].astype(int)
data.head()

  Класс пассажира  Год рождения     Пол  Выживший
0             1st          1993  female         1
1             1st          2020  female         0
2             1st          1992    male         0
3             1st          1997  female         0
4             1st          2021    male         1

In [14]:
data.isna().sum()

Класс пассажира    0
Год рождения       0
Пол                0
Выживший           0
dtype: int64

### 8.	Сохранить получившийся набор данных в формате CSV в файле ФИО_Titanic.csv

In [15]:
data.to_csv('ВолковаТатьянаПИ19-2_Titanic.csv', encoding='cp1251', index=False, sep=';')

### 9.	Открыть данный файл в программе Microsoft Excel и сохранить в формате .xlsx

### 10.	Считать файл .xlsx в новый DataFrame

In [17]:
data_new = pd.read_excel("ВолковаТатьянаПИ19-2_Titanic.xlsx")
data_new.head()

  Класс пассажира  Год рождения     Пол  Выживший
0             1st          1993  female         1
1             1st          2020  female         0
2             1st          1992    male         0
3             1st          1997  female         0
4             1st          2021    male         1

## Контрольные вопросы

### 1.	Какие две главные структуры данных используются в pandas? В чем их отличие?

1 - Series - одномерный массив
2 - DataFrame - двумерный массив, таблица, по сути является набором нескольких Series

### 2.	Назовите основные функции чтения данных из файлов в Pandas.

pandas.read_csv()
      .read_exel()
      .read_json()
      .read_hdf()
      .read_pickle()
и т.д.

### 3.	Напишите функцию записи набора данных А в файл с разделителями-запятыми.

A.to_csv('A.csv', sep=',')
или можно не указывать разделитель, т.к. по умолчанию запятая

### 4.	Как называется функция, выводящая на экран первые N строчек набора данных

pandas.DataFrame.head(N)

### 5.	С помощью какой функции можно удалить поле набора данных? А строку?

pandas.DataFrame.drop(axis = 1) - удалить поле
pandas.DataFrame.drop(axis = 0) - удалить строку

drop(labels=None, index=None, columns=None)
labels – номера или названия столбцов для удаления
index – определяет, какие строки надо удалить
columns – определяет, какие столбцы надо удалить

### 6.	Напишите участок кода, демонстрирующий возможность добавления новой строки к набору данных.

1 способ     df.append(new_row, ignore_index=True)
2 способ     df.loc[len(df.index)] = new_row

df - набор данных, куда добавляем
new_row - строка, которую добавляем, type=list

### 7.	Напишите участок кода, демонстрирующий возможность добавления новой колонки (поля) к набору данных.

df["column_name"] = new_column
df.insert(index, "column_name", new_column)
df.loc[:, "column_name"] = new_column

df - набор данных, куда добавляем
column_name - название нового столбца
new_column - значения, type=list